{
  "Lap Swim": "Open lap swimming for all skill levels. Lanes are shared with other swimmers.",
  "Open Swim": "Recreational swimming time for all ages. The entire pool is available for general use.",
  "Quiet Swim": "A quieter swimming environment with reduced noise and activity. Ideal for those seeking a calmer aquatic experience.",
  "Adult Swim": "Swimming time reserved for adults (18+). A great opportunity for fitness swimming or relaxation.",
  "Deep Water Aerobics": "High-intensity water aerobics in the deep end using flotation belts. No swimming skills required. Great cardio workout with zero impact on joints.",
  "Shallow Water Aerobics": "Water aerobics in the shallow end of the pool. No swimming skills required. Low-impact cardiovascular workout.",
  "Stroke Improvement": "Instruction focused on improving swimming technique for all strokes. Suitable for swimmers who can already swim at least one lap.",
  "Adult Fitness Swim": "Structured swim workout for adults looking to improve fitness through swimming.",
  "Zumba": "Zumba combines high energy, captivating music with Latin inspired moves that will leave you asking for more. Zumba is a \"feel good\" total workout, mixing low and high intensity moves for an interval-style, calorie burning dance fitness party! All levels welcome.",
  "Zumba Gold": "A modified Zumba class for active older adults or beginners. Lower intensity with easy-to-follow choreography.",
  "Zumba®": "Zumba combines high energy, captivating music with Latin inspired moves that will leave you asking for more. Zumba is a \"feel good\" total workout, mixing low and high intensity moves for an interval-style, calorie burning dance fitness party! All levels welcome.",
  "Yoga": "A practice combining physical postures, breathing techniques, and meditation. Improves flexibility, strength, and mental clarity.",
  "Vinyasa Yoga": "A dynamic style of yoga linking breath with movement. Flows through poses in a continuous sequence.",
  "Yoga I": "Beginner-friendly yoga class introducing fundamental poses and breathing techniques.",
  "HIIT": "High-Intensity Interval Training alternating between intense bursts of activity and fixed periods of less-intense activity or rest.",
  "HIIT Cycle": "High-intensity interval training on stationary bikes. Burn calories and build endurance.",
  "Indoor Cycling": "Group cycling class on stationary bikes with music and instructor guidance. Great cardio workout.",
  "Total Body Conditioning": "Full-body workout targeting all major muscle groups using various equipment and exercises.",
  "Core Training": "Focused workout targeting abdominal and back muscles to build core strength and stability.",
  "Meditation": "Guided meditation practice for stress reduction, mental clarity, and relaxation.",
  "Ai Chi": "A water-based exercise combining Tai Chi concepts with aquatic therapy. Slow, flowing movements promote relaxation and balance.",
  "Barre": "Ballet-inspired fitness class using a ballet barre for support. Focuses on small movements to tone muscles.",
  "Pickleball": "Drop-in pickleball play. Paddles and balls provided. All skill levels welcome.",
  "Open Gym": "Open gymnasium time for basketball, volleyball, or other activities. Equipment may be available.",
  "Full Court Basketball": "Full court basketball available for drop-in play.",
  "Pool Closed": "The pool is closed during this time for maintenance, cleaning, or private events.",
  "Gym Closed": "The gymnasium is closed during this time."
}

